spec/fixtures/vcr_cassettes/ChartMogul_CustomerInvoices/API_Actions/creates_the_customer_invoice_correctly.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.chartmogul.com/v1/data_sources/ds_03cfd2c4-2c7e-11ee-ab23-cb0f008cff46
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/3.3.1
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 200
      message: OK
    headers:
      access-control-allow-credentials:
      - 'true'
      content-type:
      - application/json
      date:
      - Mon, 30 Oct 2023 02:58:40 GMT
      content-length:
      - '158'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"uuid":"ds_03cfd2c4-2c7e-11ee-ab23-cb0f008cff46","name":"Google Sheets
        app","system":"Google Sheets","created_at":"2023-07-27T13:03:43.614Z","status":"idle"}'
    http_version:
  recorded_at: Mon, 30 Oct 2023 02:58:40 GMT
- request:
    method: get
    uri: https://api.chartmogul.com/v1/customers/cus_23551596-2c7e-11ee-9ea1-2bfe193640c0
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/3.3.1
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 200
      message: OK
    headers:
      access-control-allow-credentials:
      - 'true'
      content-type:
      - application/json
      date:
      - Mon, 30 Oct 2023 02:58:40 GMT
      content-length:
      - '929'
      connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        eyJpZCI6MTE0MTY3NDQ5LCJ1dWlkIjoiY3VzXzIzNTUxNTk2LTJjN2UtMTFlZS05ZWExLTJiZmUxOTM2NDBjMCIsImV4dGVybmFsX2lkIjoiY3VzXzAwMSIsIm5hbWUiOiJQZXRlciBHaWJib25zIiwiZW1haWwiOiJwZXRlckBleGFtcGxlLmNvbSIsInN0YXR1cyI6Ik5ldyBMZWFkIiwiY3VzdG9tZXItc2luY2UiOm51bGwsImF0dHJpYnV0ZXMiOnsiY3VzdG9tIjp7fSwiY2xlYXJiaXQiOnt9LCJzdHJpcGUiOnt9LCJ0YWdzIjpbImF1dG8tY2h1cm5lZC1kZWxpbnF1ZW50LXN1YnNjcmlwdGlvbiJdfSwiZGF0YV9zb3VyY2VfdXVpZCI6ImRzXzAzY2ZkMmM0LTJjN2UtMTFlZS1hYjIzLWNiMGYwMDhjZmY0NiIsImRhdGFfc291cmNlX3V1aWRzIjpbImRzXzAzY2ZkMmM0LTJjN2UtMTFlZS1hYjIzLWNiMGYwMDhjZmY0NiJdLCJleHRlcm5hbF9pZHMiOlsiY3VzXzAwMSJdLCJjb21wYW55IjoiSW5pdGVjaCIsImNvdW50cnkiOiJVUyIsInN0YXRlIjoiQ0EiLCJjaXR5IjoiU2FuIEZyYW5jaXNjbyIsInppcCI6IjEyMzQ1IiwibGVhZF9jcmVhdGVkX2F0IjoiMjAxNS0xMS0wMVQwMDowMDowMC4wMDBaIiwiZnJlZV90cmlhbF9zdGFydGVkX2F0IjoiMjAxNS0xMS0wN1QwMToyMDowMC4wMDBaIiwiYWRkcmVzcyI6eyJjb3VudHJ5IjoiVW5pdGVkIFN0YXRlcyIsInN0YXRlIjoiQ2FsaWZvcm5pYSIsImNpdHkiOiJTYW4gRnJhbmNpc2NvIiwiYWRkcmVzc196aXAiOiIxMjM0NSJ9LCJtcnIiOjAsImFyciI6MCwiYmlsbGluZy1zeXN0ZW0tdXJsIjpudWxsLCJjaGFydG1vZ3VsLXVybCI6Imh0dHBzOi8vYXBwLmNoYXJ0bW9ndWwuY29tLyMvY3VzdG9tZXJzLzExNDE2NzQ0OS1Jbml0ZWNoIiwiYmlsbGluZy1zeXN0ZW0tdHlwZSI6Ikdvb2dsZSBTaGVldHMiLCJjdXJyZW5jeSI6IkVVUiIsImN1cnJlbmN5LXNpZ24iOiLigqwiLCJvd25lciI6bnVsbH0=
    http_version:
  recorded_at: Mon, 30 Oct 2023 02:58:40 GMT
- request:
    method: get
    uri: https://api.chartmogul.com/v1/plans/pl_de9e281e-76cb-11ee-b63f-b727630ce4d4
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/3.3.1
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 200
      message: OK
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - max-age=0, private, must-revalidate
      content-type:
      - application/json; charset=utf-8
      date:
      - Mon, 30 Oct 2023 02:58:40 GMT
      etag:
      - W/"fe6ec38e44f2cb5de77ecfc2db2ddd07"
      referrer-policy:
      - strict-origin-when-cross-origin
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - 040cf67b39bc78976f70c6c36a42427c
      x-runtime:
      - '0.023306'
      x-xss-protection:
      - 1; mode=block
      content-length:
      - '206'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"external_id":"test_cus_pl_ext_id","name":"Test Plan","interval_count":7,"interval_unit":"day","data_source_uuid":"ds_03cfd2c4-2c7e-11ee-ab23-cb0f008cff46","uuid":"pl_de9e281e-76cb-11ee-b63f-b727630ce4d4"}'
    http_version:
  recorded_at: Mon, 30 Oct 2023 02:58:40 GMT
- request:
    method: get
    uri: https://api.chartmogul.com/v1/import/customers/cus_23551596-2c7e-11ee-9ea1-2bfe193640c0/invoices
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/3.3.1
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 200
      message: OK
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - max-age=0, private, must-revalidate
      content-type:
      - application/json; charset=utf-8
      date:
      - Mon, 30 Oct 2023 02:58:40 GMT
      etag:
      - W/"ce3c7d6b9d1d32360e0cf5806aecf83d"
      referrer-policy:
      - strict-origin-when-cross-origin
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - dea46daf04cec43f0e4f8f411bc6c7c2
      x-runtime:
      - '0.027281'
      x-xss-protection:
      - 1; mode=block
      content-length:
      - '138'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"customer_uuid":"cus_23551596-2c7e-11ee-9ea1-2bfe193640c0","invoices":[],"current_page":1,"total_pages":0,"cursor":null,"has_more":false}'
    http_version:
  recorded_at: Mon, 30 Oct 2023 02:58:40 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/import/customers/cus_23551596-2c7e-11ee-9ea1-2bfe193640c0/invoices
    body:
      encoding: UTF-8
      string: '{"invoices":[{"date":"2016-01-01 12:00:00 UTC","currency":"USD","line_items":[{"type":"subscription","subscription_external_id":"test_cus_sub_ext_id","service_period_start":"2016-01-01
        12:00:00 UTC","service_period_end":"2016-02-01 12:00:00 UTC","amount_in_cents":1000,"cancelled_at":"2016-01-15
        12:00:00 UTC","prorated":false,"quantity":5,"discount_amount_in_cents":1200,"discount_code":"DISCCODE","tax_amount_in_cents":200,"external_id":"test_cus_li_ext_id","plan_uuid":"pl_de9e281e-76cb-11ee-b63f-b727630ce4d4"}],"transactions":[{"type":"payment","date":"2016-01-01
        12:00:00 UTC","result":"successful","external_id":"test_cus_tr_ext_id"}],"external_id":"test_cus_inv_ext_id_1","data_source_uuid":"ds_03cfd2c4-2c7e-11ee-ab23-cb0f008cff46","customer_external_id":"cus_001","due_date":"2016-01-07
        12:00:00 UTC"}],"customer_uuid":"cus_23551596-2c7e-11ee-9ea1-2bfe193640c0"}'
    headers:
      User-Agent:
      - chartmogul-ruby/3.3.1
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message: Created
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - max-age=0, private, must-revalidate
      content-type:
      - application/json; charset=utf-8
      date:
      - Mon, 30 Oct 2023 02:58:41 GMT
      etag:
      - W/"c0105973d321517193399f0828e2f063"
      referrer-policy:
      - strict-origin-when-cross-origin
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - 8eb5fdef25d2457efe5deb11564af155
      x-runtime:
      - '0.146990'
      x-xss-protection:
      - 1; mode=block
      content-length:
      - '1145'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"invoices":[{"uuid":"inv_8ab74614-4e62-49f6-b4b3-f779109e50d0","date":"2016-01-01T12:00:00.000Z","due_date":"2016-01-07T12:00:00.000Z","errors":{},"external_id":"test_cus_inv_ext_id_1","currency":"USD","line_items":[{"uuid":"li_dacad109-fc67-47f9-8381-462e0fe27201","external_id":"test_cus_li_ext_id","type":"subscription","subscription_uuid":"sub_0259d4d5-a63d-4a8c-b901-4f93f95b74b0","subscription_external_id":"test_cus_sub_ext_id","prorated":false,"proration_type":null,"service_period_start":"2016-01-01T12:00:00.000Z","service_period_end":"2016-02-01T12:00:00.000Z","plan_uuid":"pl_de9e281e-76cb-11ee-b63f-b727630ce4d4","amount_in_cents":1000,"quantity":5,"discount_code":"DISCCODE","discount_amount_in_cents":1200,"tax_amount_in_cents":200,"transaction_fees_in_cents":0,"account_code":"","transaction_fees_currency":null,"discount_description":null,"event_order":null}],"transactions":[{"uuid":"tr_13920c67-3782-4d8c-b835-03deb3dd471c","external_id":"test_cus_tr_ext_id","amount_in_cents":null,"type":"payment","date":"2016-01-01T12:00:00.000Z","result":"successful","transaction_fees_in_cents":null,"transaction_fees_currency":null}]}]}'
    http_version:
  recorded_at: Mon, 30 Oct 2023 02:58:41 GMT
recorded_with: VCR 5.1.0
